royal-mail-shipping-api/example-response.txt

<pre>Authorisation Failure<pre>REQUEST:
<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.royalmailgroup.com/integration/core/V1" xmlns:ns2="http://www.royalmailgroup.com/api/ship/V2" xmlns:ns3="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><SOAP-ENV:Header>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
        <wsse:UsernameToken wsu:Id="UsernameToken-0000">
            <wsse:Username>0127229000</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">vmYV6w21nEVwRyE1wPgj/AkBi0g=</wsse:Password>
            <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">Mjk2Nzk1ODk5</wsse:Nonce>
            <wsu:Created>2016-01-29T13:33:10</wsu:Created>
        </wsse:UsernameToken>
    </wsse:Security>
</SOAP-ENV:Header><SOAP-ENV:Body><ns2:createShipmentRequest><ns2:integrationHeader><ns1:dateTime>2016-01-29T13:33:10</ns1:dateTime><ns1:version>2</ns1:version><ns1:identification><ns1:applicationId>0127229000</ns1:applicationId><ns1:transactionId>1</ns1:transactionId></ns1:identification></ns2:integrationHeader><ns2:requestedShipment><ns2:shipmentType><code>Delivery</code></ns2:shipmentType><ns2:serviceOccurrence>1</ns2:serviceOccurrence><ns2:serviceType><code>D</code></ns2:serviceType><ns2:serviceOffering><serviceOfferingCode><code>SD1</code></serviceOfferingCode></ns2:serviceOffering><ns2:serviceFormat><serviceFormatCode><code></code></serviceFormatCode></ns2:serviceFormat><ns2:shippingDate>2016-01-29</ns2:shippingDate><ns2:recipientContact><ns2:name>shippingName</ns2:name><ns2:complementaryName>shippingCompany</ns2:complementaryName></ns2:recipientContact><ns2:recipientAddress><addressLine1>shippingAddress1</addressLine1><addressLine2>shippingAddress2</addressLine2><postTown>shippingTown</postTown><postcode>shippingPostcode</postcode></ns2:recipientAddress><ns2:items><ns2:item><ns2:numberOfItems>0</ns2:numberOfItems><ns2:weight><unitOfMeasure><unitOfMeasureCode><code>g</code></unitOfMeasureCode></unitOfMeasure><value>0</value></ns2:weight></ns2:item></ns2:items></ns2:requestedShipment></ns2:createShipmentRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>

</pre>