framework/Classes/royalmail.py

from Classes.AbstractService import Service
from BuiltInService import requests
import xml.etree.ElementTree as ET
from Modules.data_converter import data_converter as converter
from Modules.data_validator import Validator 
from Modules.network import networking as netw
import http.client
class royalmail(Service):
	def label(self,paramlist):
		payload = "<SOAP-ENV:Envelope xmlns:SOAP-ENV=\"http://schemas.xmlsoap.org/soap/envelope/\"><SOAP-ENV:Header><oas:Security xmlns:oas=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd\">\n  <!--You may enter ANY elements at this point-->\n  <AnyElement/>\n</oas:Security></SOAP-ENV:Header><SOAP-ENV:Body><v2:printLabelRequest xmlns:v2=\"http://www.royalmailgroup.com/api/ship/V2\" xmlns:v1=\"http://www.royalmailgroup.com/integration/core/V1\">\n  <v2:integrationHeader>\n    <!--Optional:-->\n    <v1:dateTime>2008-09-28T20:49:45</v1:dateTime>\n    <!--Optional:-->\n    <v1:version>1000.00</v1:version>\n    <v1:identification>\n      <!--Optional:-->\n      <v1:endUserId>string</v1:endUserId>\n      <v1:applicationId>string</v1:applicationId>\n      <!--Optional:-->\n      <v1:intermediaryId>string</v1:intermediaryId>\n      <v1:transactionId>string</v1:transactionId>\n    </v1:identification>\n    <!--Optional:-->\n    <v1:testFlag>true</v1:testFlag>\n    <!--Optional:-->\n    <v1:debugFlag>true</v1:debugFlag>\n    <!--Optional:-->\n    <v1:performanceFlag>true</v1:performanceFlag>\n  </v2:integrationHeader>\n  <v2:shipmentNumber>string</v2:shipmentNumber>\n  <!--Optional:-->\n  <v2:outputFormat>string</v2:outputFormat>\n  <!--Optional:-->\n  <v2:localisedAddress>\n    <!--Optional:-->\n    <v2:recipientContact>\n      <!--Optional:-->\n      <v2:name>string</v2:name>\n      <!--Optional:-->\n      <v2:complementaryName>string</v2:complementaryName>\n      <!--Optional:-->\n      <v2:telephoneNumber>\n        <!--Optional:-->\n        <contactMechanismIdentifier>string</contactMechanismIdentifier>\n        <!--Optional:-->\n        <contactMethod>\n          <contactMethodCode>\n            <!--Optional:-->\n            <identifier>string</identifier>\n            <!--Optional:-->\n            <code>string</code>\n            <!--Optional:-->\n            <name>string</name>\n            <!--Optional:-->\n            <description>string</description>\n          </contactMethodCode>\n        </contactMethod>\n        <!--Optional:-->\n        <contactUsage>\n          <contactUsageCode>\n            <!--Optional:-->\n            <identifier>string</identifier>\n            <!--Optional:-->\n            <code>string</code>\n            <!--Optional:-->\n            <name>string</name>\n            <!--Optional:-->\n            <description>string</description>\n          </contactUsageCode>\n        </contactUsage>\n        <!--Optional:-->\n        <audit>\n          <lastUpdateDate>2006-08-19T12:27:14-05:00</lastUpdateDate>\n          <lastUpdateUserIdentifier>string</lastUpdateUserIdentifier>\n        </audit>\n        <!--Optional:-->\n        <countryCode>100</countryCode>\n        <!--Optional:-->\n        <areaCode>100</areaCode>\n        <!--Optional:-->\n        <telephoneNumber>100</telephoneNumber>\n        <!--Optional:-->\n        <extensionNumber>100</extensionNumber>\n        <!--Optional:-->\n        <speedDialNumber>100</speedDialNumber>\n      </v2:telephoneNumber>\n      <!--Optional:-->\n      <v2:electronicAddress>\n        <!--Optional:-->\n        <contactMechanismIdentifier>string</contactMechanismIdentifier>\n        <!--Optional:-->\n        <contactMethod>\n          <contactMethodCode>\n            <!--Optional:-->\n            <identifier>string</identifier>\n            <!--Optional:-->\n            <code>string</code>\n            <!--Optional:-->\n            <name>string</name>\n            <!--Optional:-->\n            <description>string</description>\n          </contactMethodCode>\n        </contactMethod>\n        <!--Optional:-->\n        <contactUsage>\n          <contactUsageCode>\n            <!--Optional:-->\n            <identifier>string</identifier>\n            <!--Optional:-->\n            <code>string</code>\n            <!--Optional:-->\n            <name>string</name>\n            <!--Optional:-->\n            <description>string</description>\n          </contactUsageCode>\n        </contactUsage>\n        <!--Optional:-->\n        <audit>\n          <lastUpdateDate>2009-05-16T07:42:28</lastUpdateDate>\n          <lastUpdateUserIdentifier>string</lastUpdateUserIdentifier>\n        </audit>\n        <electronicAddress>string</electronicAddress>\n      </v2:electronicAddress>\n    </v2:recipientContact>\n    <!--Optional:-->\n    <v2:recipientAddress>\n      <!--Zero or more repetitions:-->\n      <addressUsageType>\n        <addressUsageCode>\n          <!--Optional:-->\n          <identifier>string</identifier>\n          <!--Optional:-->\n          <code>string</code>\n          <!--Optional:-->\n          <name>string</name>\n          <!--Optional:-->\n          <description>string</description>\n        </addressUsageCode>\n      </addressUsageType>\n      <!--Optional:-->\n      <domesticIndicator>false</domesticIndicator>\n      <!--Optional:-->\n      <buildingName>string</buildingName>\n      <!--Optional:-->\n      <buildingNumber>100</buildingNumber>\n      <!--Optional:-->\n      <addressLine1>string</addressLine1>\n      <!--Optional:-->\n      <addressLine2>string</addressLine2>\n      <!--Optional:-->\n      <addressLine3>string</addressLine3>\n      <!--Optional:-->\n      <addressLine4>string</addressLine4>\n      <!--Optional:-->\n      <stateOrProvince>\n        <stateOrProvinceCode>\n          <!--Optional:-->\n          <identifier>string</identifier>\n          <!--Optional:-->\n          <code>string</code>\n          <!--Optional:-->\n          <name>string</name>\n          <!--Optional:-->\n          <description>string</description>\n        </stateOrProvinceCode>\n      </stateOrProvince>\n      <!--Optional:-->\n      <postTown>string</postTown>\n      <!--Optional:-->\n      <county>\n        <countyCode>\n          <!--Optional:-->\n          <identifier>string</identifier>\n          <!--Optional:-->\n          <code>string</code>\n          <!--Optional:-->\n          <name>string</name>\n          <!--Optional:-->\n          <description>string</description>\n        </countyCode>\n      </county>\n      <!--Optional:-->\n      <postcode>string</postcode>\n      <!--Optional:-->\n      <country>\n        <countryCode>\n          <!--Optional:-->\n          <identifier>string</identifier>\n          <!--Optional:-->\n          <code>string</code>\n          <!--Optional:-->\n          <name>string</name>\n          <!--Optional:-->\n          <description>string</description>\n        </countryCode>\n      </country>\n      <!--Optional:-->\n      <status>\n        <status>\n          <statusCode>\n            <!--Optional:-->\n            <identifier>string</identifier>\n            <!--Optional:-->\n            <code>string</code>\n            <!--Optional:-->\n            <name>string</name>\n            <!--Optional:-->\n            <description>string</description>\n          </statusCode>\n        </status>\n        <validFrom>2002-11-05T02:01:03-06:00</validFrom>\n        <!--Optional:-->\n        <validTo>2002-06-24T10:46:32-05:00</validTo>\n      </status>\n      <!--Optional:-->\n      <audit>\n        <lastUpdateDate>2016-02-20T08:56:29-06:00</lastUpdateDate>\n        <lastUpdateUserIdentifier>string</lastUpdateUserIdentifier>\n      </audit>\n    </v2:recipientAddress>\n  </v2:localisedAddress>\n</v2:printLabelRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>"

		headers = {
		    'x-ibm-client-id': "411e31ec-80c1-4798-a5d3-3214fb0b8e91",
		    'x-ibm-client-secret': "yL6vK7fO3cW6bY2vS3bI3bA7gM0uE0lG8wV3uJ5lA2qI3pY8vQ",
		    'soapaction': "printLabel",
		    'content-type': "text/xml",
		    'accept': "application/xml"
		    }

		conn.request("POST", "/shipping/v2", payload, headers)

		res = conn.getresponse()
		data = res.read()

		print(data.decode("utf-8"))